Pandas Select

Pandas select refers to the process of extracting specific portions of data from a DataFrame.

Select Data Using Indexing and Slicing

In [1]:
import pandas as pd
data = {'Name': ['Abu Bakar', 'Bilal', 'Hassan', 'Alex', 'Mitchel Starc'],
        'Age': [25, 22, 17, 32, 35],
        'City': ['Berlin', 'Karachi', 'Hamburg', 'Berlin', 'Sydney']}
df = pd.DataFrame(data)

In [2]:
df

            Name  Age     City
0      Abu Bakar   25   Berlin
1          Bilal   22  Karachi
2         Hassan   17  Hamburg
3           Alex   32   Berlin
4  Mitchel Starc   35   Sydney

In [4]:
df['Name'] #selecting single column name

0        Abu Bakar
1            Bilal
2           Hassan
3             Alex
4    Mitchel Starc
Name: Name, dtype: object

In [5]:
df[['Name','Age']]

            Name  Age
0      Abu Bakar   25
1          Bilal   22
2         Hassan   17
3           Alex   32
4  Mitchel Starc   35

In [10]:
# selecting multiple columns
age_salary_columns = df[['Age', 'City']]

print("Selecting multiple columns: Age and City")
print(age_salary_columns.to_string(index=False))
print()

Selecting multiple columns: Age and City
 Age    City
  25  Berlin
  22 Karachi
  17 Hamburg
  32  Berlin
  35  Sydney

In [17]:
# selecting rows using slicing
df[0:2]

        Name  Age     City
0  Abu Bakar   25   Berlin
1      Bilal   22  Karachi

Using loc and iloc to Select Data

In [18]:
df.loc[:,['Name','City']]

            Name     City
0      Abu Bakar   Berlin
1          Bilal  Karachi
2         Hassan  Hamburg
3           Alex   Berlin
4  Mitchel Starc   Sydney

In [25]:
df.iloc[0:3,0:2]

        Name  Age
0  Abu Bakar   25
1      Bilal   22
2     Hassan   17

In [32]:
df.iloc[[0,2],[1,0]]

   Age       Name
0   25  Abu Bakar
2   17     Hassan

In [34]:
df.loc[[0, 2], ['Name', 'City']]  #(.loc[] does NOT support slicing with lists.)

        Name     City
0  Abu Bakar   Berlin
2     Hassan  Hamburg

Select Rows Based on Specific Criteria

In [37]:
df[df['Name'] == 'Abu Bakar']

        Name  Age    City
0  Abu Bakar   25  Berlin

In [43]:
# df[df['Name'].str.startswith('A', case=False)]
df[df['Name'].str.startswith('A')]

        Name  Age    City
0  Abu Bakar   25  Berlin
3       Alex   32  Berlin

In [50]:
# df.loc[(df['Name'].str.startswith('A')) & (df['Age']>26)]
df[(df['Name'].str.startswith('A')) & (df['Age']>26)]

   Name  Age    City
3  Alex   32  Berlin

In [52]:
df[(df['Name'].str.contains('A', case= False)) & (df['Age']>24)]

            Name  Age    City
0      Abu Bakar   25  Berlin
3           Alex   32  Berlin
4  Mitchel Starc   35  Sydney

query() to Select Data

In [57]:
df.query('Age >= 24')

            Name  Age    City
0      Abu Bakar   25  Berlin
3           Alex   32  Berlin
4  Mitchel Starc   35  Sydney

In [58]:
df.query('Age >= 24')

            Name  Age    City
0      Abu Bakar   25  Berlin
3           Alex   32  Berlin
4  Mitchel Starc   35  Sydney

In [60]:
nameFiltered = ['Abu Bakar','Bilal']
df[df['Name'].isin(nameFiltered)]

        Name  Age     City
0  Abu Bakar   25   Berlin
1      Bilal   22  Karachi